src/cf/DataProcessors/ор_ПанельОбменаАптекаРУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ор_ПанельОбменаАптекаРУ</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/ор_СтатусыИнформированияАптекаРУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ор_СтатусыИнформированияАптекаРУ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ор_СтатусыОбменаАптекаРУ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусАптекаРУ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ор_СтатусыИнформированияАптекаРУ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СообщениеОбОшибке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ор_СтатусыОбменаАптекаРУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ор_СтатусыОбменаАптекаРУ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Принят</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возвращен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовКВыдаче</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/DataProcessors/ор_ПанельОбменаАптекаРУ/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация = ПолучитьОрганизацию();
	ЗаполнитьСписокЗаказовНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	ЗаполнитьСписокЗаказовНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтборСтатусОбменаПриИзменении(Элемент)
	ЗаполнитьСписокЗаказовНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокЗаказов

&НаКлиенте
Процедура ТаблицаЗаказовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = Элементы.ТаблицаЗаказов.ТекущиеДанные;
	
	Если Поле.Имя = "ТаблицаЗаказовЗаказПокупателя"
		И ТекДанные <> Неопределено Тогда
		ПоказатьЗначение(, ТекДанные.ЗаказПокупателя);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьВыделенныеСтроки(Команда)
	
	ИсключитьИлиУстановитьФлажки();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсключитьВыделенныеСтроки(Команда)
	
	ИсключитьИлиУстановитьФлажки(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокЗаказов(Команда)
	ЗаполнитьСписокЗаказовНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПередатьДанные(Команда)
	
	ПередатьДанныеСУчетомВыбранногоСтатуса(Команда.Имя, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередатьДанныеОПривезенномЗаказе(Команда)
	
	ПередатьДанныеСУчетомВыбранногоСтатуса(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередатьДанныеОВыкупленномЗаказе(Команда)
	
	ПередатьДанныеСУчетомВыбранногоСтатуса(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередатьДанныеОВозвращенномЗаказе(Команда)
	
	ПередатьДанныеСУчетомВыбранногоСтатуса(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередатьДанныеОГотовомКВыдачеЗаказе(Команда)
	
	ПередатьДанныеСУчетомВыбранногоСтатуса(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередатьДанныеСУчетомВыбранногоСтатуса(ИмяКоманды, ПередачаКонкретногоСтатуса = Истина)
	
	ОчиститьСообщения();
	
	ВыбранныеСтроки = ТаблицаЗаказов.НайтиСтроки(Новый Структура("Выбран", Истина)); 
	Если ВыбранныеСтроки.Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Выберите данные для передачи!'"));
		Возврат;
	КонецЕсли;
	
	ДанныеДляПередачиОПривезенныхЗаказах.Очистить();
	ДанныеДляПередачиОГотовыхКВыдачеЗаказах.Очистить();
	ДанныеДляПередачиОВыкупленныхЗаказах.Очистить();
	ДанныеДляПередачиОВозвращенныхЗаказах.Очистить();
	
	Для Каждого СтрокаТЧ Из ТаблицаЗаказов Цикл
		
		СтатусОбменаТекущий = СтрокаТЧ.СтатусОбмена;
		Если СтатусОбменаТекущий = ПредопределенноеЗначение("Перечисление.ор_СтатусыОбменаАптекаРУ.Возвращен")
			Или Не СтрокаТЧ.Выбран Тогда
			Продолжить;
		КонецЕсли;
		
		ДобавитьСтрокуПередачи(СтатусОбменаТекущий, ПередачаКонкретногоСтатуса, СтрокаТЧ.ЗаказПокупателя, ИмяКоманды);
		
	КонецЦикла;
	
	МассивЗаказовДляПередачи = Новый Массив();
	
	// Привезенные в аптеку заказы.
	Для Каждого Строка Из ДанныеДляПередачиОПривезенныхЗаказах Цикл
		МассивЗаказовДляПередачи.Добавить(Строка.ЗаказПокупателя);
	КонецЦикла;
	
	ор_ОбменСАптекаРУКлиент.ПередатьПакетЗаказовПоДействию(МассивЗаказовДляПередачи, "ПередатьДанныеОПривезенномЗаказе", Организация);
	
	МассивЗаказовДляПередачи.Очистить();
	
	// Готовые к выдаче заказы.
	Для Каждого Строка Из ДанныеДляПередачиОГотовыхКВыдачеЗаказах Цикл
		МассивЗаказовДляПередачи.Добавить(Строка.ЗаказПокупателя);
	КонецЦикла;
	
	ор_ОбменСАптекаРУКлиент.ПередатьПакетЗаказовПоДействию(МассивЗаказовДляПередачи, "ПередатьДанныеОГотовностиКВыдачеЗаказа", Организация);
	
	МассивЗаказовДляПередачи.Очистить();
	
	// Выкупленные заказы.
	Для Каждого Строка Из ДанныеДляПередачиОВыкупленныхЗаказах Цикл
		МассивЗаказовДляПередачи.Добавить(Строка.ЗаказПокупателя);
	КонецЦикла;
	
	ор_ОбменСАптекаРУКлиент.ПередатьПакетЗаказовПоДействию(МассивЗаказовДляПередачи, "ПередатьДанныеОВыкупленномЗаказе", Организация);
	
	МассивЗаказовДляПередачи.Очистить();
	
	// Возвращенные заказы.
	Для Каждого Строка Из ДанныеДляПередачиОВозвращенныхЗаказах Цикл
		МассивЗаказовДляПередачи.Добавить(Строка.ЗаказПокупателя);
	КонецЦикла;
	
	ор_ОбменСАптекаРУКлиент.ПередатьПакетЗаказовПоДействию(МассивЗаказовДляПередачи, "ПередатьДанныеОВозвращенномЗаказе", Организация);
	
	МассивЗаказовДляПередачи.Очистить();
	
	ЗаполнитьСписокЗаказовНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтрокуПередачи(СтатусОбменаТекущий, ПередачаКонкретногоСтатуса, ЗаказПокупателя, ИмяКоманды)
	
	СтрокаПередачи = Неопределено;
	
	Если Не ПередачаКонкретногоСтатуса Тогда
		
		Если СтатусОбменаТекущий = ПредопределенноеЗначение("Перечисление.ор_СтатусыОбменаАптекаРУ.Принят") Тогда
			СтрокаПередачи = ДанныеДляПередачиОГотовыхКВыдачеЗаказах.Добавить();
		ИначеЕсли СтатусОбменаТекущий = ПредопределенноеЗначение("Перечисление.ор_СтатусыОбменаАптекаРУ.ГотовКВыдаче") Тогда
			СтрокаПередачи = ДанныеДляПередачиОВыкупленныхЗаказах.Добавить();
		ИначеЕсли СтатусОбменаТекущий = ПредопределенноеЗначение("Перечисление.ор_СтатусыОбменаАптекаРУ.Черновик") Тогда
			СтрокаПередачи = ДанныеДляПередачиОПривезенныхЗаказах.Добавить();
		КонецЕсли;
		
	Иначе
		
		Если ИмяКоманды = "ПередатьДанныеОПривезенномЗаказе" Тогда
			СтрокаПередачи = ДанныеДляПередачиОПривезенныхЗаказах.Добавить();
		ИначеЕсли ИмяКоманды = "ПередатьДанныеОГотовностиКВыдачеЗаказа" Тогда
			СтрокаПередачи = ДанныеДляПередачиОГотовыхКВыдачеЗаказах.Добавить();
		ИначеЕсли ИмяКоманды = "ПередатьДанныеОВыкупленномЗаказе" Тогда
			СтрокаПередачи = ДанныеДляПередачиОВыкупленныхЗаказах.Добавить();
		ИначеЕсли ИмяКоманды = "ПередатьДанныеОВозвращенномЗаказе" Тогда
			СтрокаПередачи = ДанныеДляПередачиОВозвращенныхЗаказах.Добавить();
		КонецЕсли;
		
	КонецЕсли;
	
	Если СтрокаПередачи <> Неопределено Тогда
		СтрокаПередачи.ЗаказПокупателя = ЗаказПокупателя;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСписокЗаказовНаСервере()
	
	ТаблицаЗаказов.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Заказ.Ссылка КАК Ссылка,
		|	Заказ.ор_НомерЗаказаАптекаРУ КАК НомерЗаказаАптекаРУ,
		|	ор_СтатусыИнформированияАптекаРУ.СтатусОбмена КАК Статус,
		|	ор_СтатусыИнформированияАптекаРУ.СообщениеОбОшибке КАК СообщениеОбОшибке,
		|	Заказ.Организация КАК Организация
		|ПОМЕСТИТЬ ЗаказыСоСтатусами
		|ИЗ
		|	РегистрСведений.ор_СтатусыИнформированияАптекаРУ КАК ор_СтатусыИнформированияАптекаРУ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК Заказ
		|		ПО ор_СтатусыИнформированияАптекаРУ.ЗаказПокупателя = Заказ.Ссылка
		|ГДЕ
		|	Заказ.ор_НомерЗаказаАптекаРУ <> """"
		|	И Заказ.Организация = &Организация
		|	И &ОтборПоСтатусуОбмена
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛОЖЬ КАК Выбран,
		|	ЗаказПокупателя.Ссылка КАК Ссылка,
		|	ЗаказПокупателя.ор_НомерЗаказаАптекаРУ КАК НомерЗаказаАптекаРУ,
		|	ЗНАЧЕНИЕ(Перечисление.ор_СтатусыОбменаАптекаРУ.Черновик) КАК Статус,
		|	"""" КАК СообщениеОбОшибке,
		|	ЗаказПокупателя.Организация КАК Организация
		|ПОМЕСТИТЬ ВсеЗаказы
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|ГДЕ
		|	ЗаказПокупателя.ор_НомерЗаказаАптекаРУ <> """"
		|	И НЕ ЗаказПокупателя.Ссылка В
		|					(ВЫБРАТЬ
		|						ЗаказыСоСтатусами.Ссылка КАК Ссылка
		|					ИЗ
		|						ЗаказыСоСтатусами КАК ЗаказыСоСтатусами
		|					СГРУППИРОВАТЬ ПО
		|						ЗаказыСоСтатусами.Ссылка)
		|			И НЕ ЗаказПокупателя.Ссылка В
		|					(ВЫБРАТЬ
		|						ор_СтатусыИнформированияАптекаРУ.ЗаказПокупателя КАК ЗаказПокупателя
		|					ИЗ
		|						РегистрСведений.ор_СтатусыИнформированияАптекаРУ КАК ор_СтатусыИнформированияАптекаРУ)
		|	И ЗаказПокупателя.Организация = &Организация
		|	И (&СтатусОбмена = ЗНАЧЕНИЕ(Перечисление.ор_СтатусыОбменаАптекаРУ.Черновик)
		|			ИЛИ &СтатусОбмена = ЗНАЧЕНИЕ(Перечисление.ор_СтатусыОбменаАптекаРУ.ПустаяСсылка))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛОЖЬ,
		|	ЗаказыСоСтатусами.Ссылка,
		|	ЗаказыСоСтатусами.НомерЗаказаАптекаРУ,
		|	ЗаказыСоСтатусами.Статус,
		|	ЗаказыСоСтатусами.СообщениеОбОшибке,
		|	ЗаказыСоСтатусами.Организация
		|ИЗ
		|	ЗаказыСоСтатусами КАК ЗаказыСоСтатусами
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВсеЗаказы.Ссылка КАК ЗаказПокупателя,
		|	ВсеЗаказы.Выбран КАК Выбран,
		|	ВсеЗаказы.НомерЗаказаАптекаРУ КАК НомерЗаказаАптекаРУ,
		|	ВсеЗаказы.Статус КАК СтатусОбмена,
		|	ВсеЗаказы.СообщениеОбОшибке КАК СообщениеОбОшибке,
		|	ВсеЗаказы.Организация КАК Организация
		|ИЗ
		|	ВсеЗаказы КАК ВсеЗаказы";
	
	Запрос.УстановитьПараметр("Организация" , Организация);
	Запрос.УстановитьПараметр("СтатусОбмена", СтатусОбмена);
	
	Если Не ЗначениеЗаполнено(СтатусОбмена) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоСтатусуОбмена", "ИСТИНА");
	ИначеЕсли СтатусОбмена <> Перечисления.ор_СтатусыОбменаАптекаРУ.Черновик Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоСтатусуОбмена", "ор_СтатусыИнформированияАптекаРУ.СтатусОбмена = &СтатусОбмена");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоСтатусуОбмена", "ЛОЖЬ");
	КонецЕсли;
	
	Если Запрос.Выполнить().Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаЗаказов.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ИсключитьИлиУстановитьФлажки(Исключить = Ложь)
	
	Для Каждого СтрокаТЧ Из ТаблицаЗаказов Цикл
		СтрокаТЧ.Выбран = ?(Исключить, Ложь, Истина);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОрганизацию()
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций") Тогда
		Возврат ПерсональныеНастройкиРУНФ.Прочитать("ОсновнаяОрганизация");
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.ИмяПредопределенныхДанных = &ИмяПредопределенныхДанных
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Организации.Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации");
	
	Запрос.УстановитьПараметр("ИмяПредопределенныхДанных", "ОсновнаяОрганизация");
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Справочники.Организации.ПустаяСсылка();
	
КонецФункции

#КонецОбласти
